Revit 2027 API
SelectionUIOptions.ActivateControlsAndDimensionsOnMultiSelect Property
 Indicates whether controls and temporary dimensions are activated on selection of multiple elements.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ActivateControlsAndDimensionsOnMultiSelect { get; set; }
Public Property ActivateControlsAndDimensionsOnMultiSelect As Boolean
	Get
	Set
public:
property bool ActivateControlsAndDimensionsOnMultiSelect {
	bool get ();
	void set (bool value);
}
member ActivateControlsAndDimensionsOnMultiSelect : bool with get, set
Property Value
Boolean
Remarks
 Revit always shows certain controls and temporary dimensions for a single selected element When this option is set Revit also shows these controls and dimensions when multiple elements are selected. Note that this setting takes effect on the next selection change. To have this change take effect immediately use
Selection.SetElementIds(Selection.GetElementIds());
See Also
Reference
SelectionUIOptions Class
Autodesk.Revit.UI Namespace